# SetDefaultTexMap

## Description
Set the object to have default texture mapping info. Texture resource being used is set with SetTextureRef. Similar to SetDefaultTextureSpace except that routine has been superseded in version 2009.

```pascal
PROCEDURE SetDefaultTexMap(h : HANDLE);
```

```python

def vs.SetDefaultTexMap(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||

## Version
```diff
- SetDefaultTexMap is obsolete as of Vectorworks 2010
```

Availability: from Vectorworks 2009
## Category
* Textures